{
    "experiences": [
        {
            "year": "December - Ongoing",
            "role": "Scholarship to be Cloud Engineer in Japan Awardee",
            "company": "Kebun Academy x PT ANC Japan",
            "description": "Selected for a year-long scholarship program preparing candidates for Cloud Engineering careers in Japan through intensive JLPT N3-level Japanese language training, AWS Cloud professional certification, and career preparation including interview opportunities with Japanese companies.",
            "technologies": [
                "Japanese",
                "AWS Cloud",
                "Cloud Architecture",
                "Linux",
                "Networking",
                "DevOps Fundamentals"
            ]
        },
        {
            "year": "Oktober - December 2025",
            "role": "AWS re/Start Student",
            "company": "Orbit Future Academy",
            "description": "Completed the AWS re/Start program, gaining hands-on experience in IT fundamentals, Linux, networking, security, Python, databases, and core AWS cloud services. Trained through scenario-based labs and projects, including cloud architecture, automation, serverless, containers, and monitoring, while also developing essential workplace and professional skills.",
            "technologies": [
                "Networking",
                "Elastic Load Balancing",
                "Cloud Architecture",
                "AWS (EC2, S3, VPC, Cloudwatch, IAM, Lambda)"
            ]
        },
        {
            "year": "September - November 2025",
            "role": "Korea-ASEAN Digital Academy Student",
            "company": "NIPA x Komdigi x ELICE",
            "description": "Completed an intensive, fully funded training program focused on full-stack web development, cloud services, UI/UX fundamentals, data analysis, and AI ethics—combining hands-on projects with real industry workflows.",
            "technologies": [
                "React",
                "MongoDB",
                "Express.js",
                "Node.js",
                "AWS",
                "AI",
                "Data Analysis",
                "Figma"
            ]
        },
        {
            "year": "January 2024 - June 2025",
            "role": "Junior Software Engineer",
            "company": "PLN Icon Plus",
            "description": "Developed and maintained responsive web applications, fixed software issues, and collaborated with cross-functional teams to deliver reliable digital solutions, including a government platform for distributing free rice cookers to priority groups.",
            "technologies": [
                "Vue.js",
                "TailwindCSS",
                "Java",
                "JSP",
                "Spring Boot",
                "Postgresql",
                "Oracle"
            ]
        },
        {
            "year": "March - September 2023",
            "role": "Teaching Assistant",
            "company": "Pacmann",
            "description": "Provided weekly mentoring and live sessions for Python beginners, evaluated student projects, and supported a 180+ member community through active Discord moderation.",
            "technologies": [
                "Teaching",
                "Python",
                "Google Colab",
                "Jupyter Notebook",
                "GitHub"
            ]
        },
        {
            "year": "September - February 2023",
            "role": "Engineering Specialist Intern",
            "company": "BINUS University",
            "description": "Supported departmental projects by developing IoT prototypes, creating digital microscope motion systems, and designing interactive LED installations for campus events. Helped produce workshop materials and trial-class modules while undergoing training in 3D printing, PCB design, and equipment operation.",
            "technologies": [
                "ESP32",
                "IoT",
                "3D Printing",
                "PCB Design",
                "Soldering",
                "Python",
                "C++"
            ]
        },
        {
            "year": "February – August 2022",
            "role": "IT Support Engineer Intern",
            "company": "PT. Boon Software",
            "description": "Provided technical support for system configuration, installation, and troubleshooting across hardware, software, and server environments. Implemented automated Apache log rotation for efficient log management and performed daily monitoring of 16+ client servers via remote tools.",
            "technologies": [
                "Linux",
                "Apache",
                "Remote Server Monitoring",
                "Shell Scripting"
            ]
        },
        {
            "year": "June 2019 - August 2023",
            "role": "Bachelor’s Student in Computer Engineering",
            "company": "BINUS University",
            "description": "This period marked my foundation in software and hardware development, where I gained core skills through academic projects, lab work, and hands-on engineering practices.",
            "technologies": [
                "C++",
                "Python",
                "IoT Development",
                "Microcontrollers"
            ]
        }
    ]
}